Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: དེ་དག་དང་གཞན་ཡང་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་གནོད་སྦྱིན་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དུ་མའི་འཁོར་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོས་བྱིན་གྱིས་བརླབས་པའི་གནས་གཙང་མའི་གཞལ་མེད་ཁང་གི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པས་འདུས་པར་གྱུར་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་འཁོད་དོ། །
en: These and other great yakṣa generals, surrounded by many hundreds of thousands of millions of yakṣa s, gathered together through the blessing and magical power of the bodhisattva, in that great assembly in the realm of the Pure Abode. Having assembled, they took their seats in order to listen to the Dharma.

source: གང་ཡང་སྲིན་པོའི་རྒྱལ་པོ་ཆེན་པོ་དེ་དག་གནོད་སྦྱིན་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དུ་མའི་འཁོར་དང་ལྡན་པ། ཁྲོ་བོའི་རྒྱལ་པོ་ཆེན་པོས་བཀུག་པ་ལ་
en: Also, the great kings of the rākṣasas, with retinues of many hundreds of thousands of millions of rākṣasas, had been brought by the Great Lord of Wrath.

source: འདི་ལྟ་སྟེ། སྒྲ་སྒྲོགས་དང་ནོར་ལྡན་དང་རྣམ་པར་འཇུ་བྱེད་དང་། གཟེར་རྣ་དང་བུམ་རྣ་དང་ཀུན་ནས་རྣ་བ་དང་། གཤིན་རྗེ་དང་རྣམ་པར་འཇིགས་བྱེད་དང་འཇིགས་བྱེད་དང་མི་བཟད་པ་དང་སྡིག་ལྡན་དང་། དབང་པོ་རྒྱལ་དང་འཐབ་པ་དང་ལེགས་པར་འཐབ་པ་དང་། མདུང་དང་མདུང་རྩེ་གསུམ་པ་དང་། མགོ་གསུམ་པ་དང་མགོ་མཐའ་ཡས་པ་ཡང་ཆོས་མཉན་པའི་ཕྱིར་འདུས་པར་གྱུར་ཏོ། །
en: They were: {1.76} Rāvaṇa, Draviṇa, Vidrāvaṇa, Śaṅkukarṇa, Kumbha, Kumbhakarṇa, Samantakarṇa, Yama, Vibhīṣaṇa, Bhīṣaṇa, Ghora, Sughora, Akṣayamati, Saṃghaṭṭa, Indrajit, Lokajit, Yodhana, Suyodhana, Śūla, Triśūla, Triśiras, and Anantaśiras. {1.77} They all gathered to hear the Dharma.

source: གང་ཡང་ཤ་ཟ་ཆེན་པོ། ཤ་ཟའི་འཁོར་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དུ་མ་དང་ལྡན་པ་དེ་དག་ཀྱང་
en: Also the great piśācas with retinues of many hundreds of thousands of millions of piśācas gathered there. They were: {1.78}

source: འདི་ལྟ་སྟེ། པཱི་ལུ་དང་ཉེ་བའི་པཱི་ལུ་དང་། པཱི་ལུ་བཟང་པོ་དང་། པཱི་ལུ་མཐའ་ཡས་དང་། བསམ་པ་དང་བསམ་པ་མ་ཡིན་པ་དང་། གདུང་བ་བཟང་པོ་དང་ཟ་བྱེད་དང་། གཟི་བརྗིད་བཟང་པོ་དང་མི་བཟད་པ་དང་མི་བཟད་པའི་གཟུགས་ཅན་ཡང་ཆོས་མཉན་པའི་ཕྱིར་འདུས་པར་གྱུར་ཏོ། །
en: Pīlu, Upapīlu, Supīlu, Anantapīlu, Manoratha, Amanoratha, Sutāpa, Grasana , Supāna, Ghora, and Ghorarūpin. {1.79} They all gathered to hear the Dharma.

source: གང་ཡང་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་ཀླུ་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དུ་མའི་འཁོར་དང་ལྡན་པ། ཁྲོ་བོའི་རྒྱལ་པོ་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་བཀུག་པ་ལ་
en: Also, the great nāga kings, with retinues of many hundreds of thousands of millions of nāga s, were brought by the Lord of Wrath through his display of the power of the bodhisattva.

source: འདི་ལྟ་སྟེ། དགའ་བོ་དང་། ཉེ་དགའ་བོ་དང་། ལ་བ་དང་ཉེ་བའི་ལ་བ་དང་། ནོར་ལྡན་དང་། མཐའ་ཡས་དང་། འཇོག་པོ་དང་པདྨ་དང་། པདྨ་ཆེན་པོ་དང་འདུས་པ་སྐྱོང་དང་། དུང་དང་དུང་སྐྱོང་དང་ཀཀྐོ་ཊ་དང་། རིགས་ལྡན་དང་། རིགས་མེད་ལྡན་དང་། ང་རྒྱལ་ཅན་དང་། བུམ་ཆུ་ཅན་དང་། རྡོ་རྗེ་ཅན་དང་མེ་ཏོག་ཙམ་པ་ཀ་ལས་བྱུང་བ་དང་ནོར་ལྡན་ཀླུ་དང་། ང་རྒྱལ་འཇོམས་དང་། མཚོན་དཔུས་དང་ཉེ་བའི་དཔུས་དང་། དབྱིག་པ་དང་དབྱིག་པ་ཆེན་པོ་དང་། དཀར་པོ་དང་དཀར་པོ་བཟང་དང་། སྔོ་བ་དང་ཆུ་སྦྱིན་སྔོ་བ་དང་འོ་མའི་ཆུ་དང་སོག་མ་མེད་དང་། རྒྱ་མཚོ་དང་ཉེ་བའི་རྒྱ་མཚོ་སྟེ།
en: They were: {1.80} Nanda, Upananda, Kambala, Upakambala, Vāsuki, Ananta, Takṣaka, Padma , Mahāpadma, Śaṅkha, Śaṅkhapāla, Karkoṭaka, Kulika, Akulika, Māṇa, Kalaśoda, Kuliśika, Cāṃpeya, Maṇināga, Mānabhañja, Dukura, Upadukura, Lakuṭa, Mahālakuṭa, Śveta, Śvetabhadra, Nīla, Nīlāmbuda, Kṣīroda, Apalāla, Sāgara, and Upasāgara. {1.81}

source: དེ་དག་དང་གཞན་ཡང་ཀླུའི་རྒྱལ་པོ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་ལྡན་པ་དེ་དག་ཀྱང་ཆོས་མཉན་པའི་ཕྱིར་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་འདུས་ཤིང་འཁོད་པར་གྱུར་ཏོ། །
en: These and other nāga s, with retinues of many hundreds of thousands of millions of nāga s, gathered together in this great assembly and took their seats to hear the Dharma.

source: གང་ཡང་དྲང་སྲོང་དང་དྲང་སྲོང་ཆེན་པོ་དེ་དག་ལ་
en: Also, the sages and the great sages gathered there.

source: འདི་ལྟ་སྟེ། རྒྱུན་ཤེས་ཀྱི་བུ་དང་། གནས་འཇོག་དང་། གཽ་ཏ་མ་དང་། བྷ་གོ་ར་ཐ་དང་། ཛ་ཧྣུ་དང་། ཨང་གི་རས་དང་། ཨ་མ་ཏི་དང་། པུ་ལ་སྟི་དང་། རི་བྱི་དང་། རྒྱས་པ་དང་། ནག་པོ་དང་། གཽ་ཏ་མ་ནག་པོ་དང་། མེ་དང་། མེའི་རྒྱུད་དང་། ཛ་མ་ད་གྣི་དང་ཡོད་པ་པ་དང་ཐུབ་པ་མཆོག་དང་། གོས་ཅན་དང་བཻ་ཤམ་པཱ་ཡཱ་ན་དང་རྩིབ་ལོགས་སྐྱེས་དང་། མོ་མཚན་གཉིས་ལས་སྐྱེས་དང་དགྲ་སྟ་དང་རྣལ་འབྱོར་དབང་ཕྱུག་དང་། ཤིང་པི་པ་ལ་གནས་པ་དང་། ཤིང་པི་པ་ལ་ཟ་བ་དང་། གྲོག་མཁར་སྐྱེས་དང་ཉི་མའི་རིགས་ཏེ
en: They were: {1.82} Ātreya, Vasiṣṭha, Gautama, Bhagīratha, Jahnu, Aṅgirasa, Agasti, Pulasti, Vyāsa, Kṛṣṇa, Kṛṣṇagautama, Agni, Agnirasa, Jāmadagni, Āstika, Muni, Munivara, Ambara, Vaiśampāyana, Parāśara, Paraśu, Yogeśvara, Pippala, Pippalāda, Vālmīki, and Mārkaṇḍa. {1.83}

source: དེ་དག་དང་གཞན་ཡང་དྲང་སྲོང་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་ལྡན་པ་དེ་དག་ཀྱང་། འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་ཉེ་བར་ཕྱིན་ཏེ།
en: These along with other great sages, with retinues of many hundreds of thousands of other great sages, entered this great gathering.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་ཕྱག་འཚལ་ནས་སྔགས་སྤྱོད་པའི་དོན་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་མཉན་པའི་ཕྱིར་དང་། རྗེས་སུ་ཡི་རང་བའི་དོན་དུ་འཁོད་པར་གྱུར་ཏོ། །
en: Having saluted Lord Śākyamuni, they sat down in order to hear and rejoice at this basket of bodhisattva teachings explaining the purpose of mantra practice.

source: གང་ཡང་ལྟོ་འཕྱེ་ཆེན་པོའི་རྒྱལ་པོ་དེ་དག་ཀྱང་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་ཆོས་མཉན་པའི་ཕྱིར་རབ་ཏུ་ཞུགས་ཏེ། འཁོད་པ་ལ་
en: Also, the great kings of the mahoragas entered this great gathering and took their seats.

source: འདི་ལྟ་སྟེ། ཨེ་རཎྜ་དང་། ཏེ་རཎྜ་དང་། འོད་ཟེར་གྱི་བུ་དང་འོད་ཟེར་དང་སྣང་བ་དང་སྣང་བ་བཟང་པོའོ། །
en: They were: {1.84} Bheraṇḍa, Bheruṇḍa, Maruṇḍa, Marīca, Mārīca, Dīpta, and Sudīpta. {1.85}

source: གང་ཡང་ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་དེ་དག་ཀྱང་ནམ་མཁའ་ལྡིང་བརྒྱ་སྟོང་དུ་མའི་འཁོར་དང་ལྡན་པ་འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་འདུས་པ་ལ་
en: Also, the garuḍa kings came together in this great assembly, with retinues of many of hundreds of thousands of garuḍas.

source: འདི་ལྟ་སྟེ། འོད་བཟང་དང་། འདབ་དཀར་དང་། རྐང་མེད་འགྲོ་དང་། འདབ་འགྲོ་དང་། འདབ་བཟངས་སྐྱེས་དང་། འདབ་མེད་སྐྱེས་དང་། ཡིད་ལྟར་མགྱོགས་དང་། ཀླུ་རྣམ་འཇིགས་དང་། རྣམ་འདུད་བུ་དང་། བ་ར་དྭ་ཛ་དང་། བྱ་དང་། བྱ་ཆེན་པོ་དང་། འདབ་ལྡན་ཚོགས་ཏེ།
en: They were: {1.86} Suparṇa, Śvetaparṇa, Pannaga, Parṇaga, Sujātapakṣa, Ajātapakṣa, Manojava, Pannaganāśana, Dhenateya, Vainateya, Bharadvāja, Śakuna , Mahāśakuna, and Pakṣirāja. {1.87}

source: དེ་དག་ཀྱང་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་འདུ་བར་གྱུར་ཏོ། །
en: They too joined this great assembly.

source: གང་ཡང་མིའམ་ཅིའི་རྒྱལ་པོ་མིའམ་ཅིའི་འཁོར་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་ལྡན་པ་དེ་དག་ཀྱང་འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་འདུས་པ་ལ་
en: Also, the kinnara kings, with retinues of many hundreds of thousands of kinnaras, came to this great gathering.

source: འདི་ལྟ་སྟེ། ལྗོན་པ་དང་ཉེ་བའི་ལྗོན་པ་དང་ལྗོན་པ་བཟང་པོ་དང་། ལྗོན་པ་མཐའ་ཡས་དང་འཇིག་རྟེན་ལྗོན་པ་དང་ལྗོན་པ་བྲལ་དང་། བྲང་རྒྱས་དང་བྲང་ཆེན་པོ་དང་གཟི་བརྗིད་ཆེན་པོ་དང་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། ཁྱད་པར་སྒྲ་དང་། སྐད་སྙན་དང་ཡིད་དུ་འོང་བའི་སེམས་སྐྱེད་པར་བྱེད་པ་དང་རིགས་མཐོ་བ་དང་མཐོ་སྒྲ་དང་། བཏང་སྙོམས་པ་དང་། སྙིང་རྗེ་ལྡན་དང་ཆུ་ལྷ་དང་།
en: They were: {1.88} Druma, Upadruma, Sudruma, Anantadruma, Lokadruma, Ledruma, Ghanoraska, Mahoraska, Mahojaska, Mahoja, Maharddhika, Viruta, Susvara, Manojña, Cittonmādakara, Unmāda, Unnata, Upekṣaka, Karuṇa, and Aruṇa. {1.89}

source: དེ་དག་དང་གཞན་ཡང་མིའམ་ཅིའི་རྒྱལ་པོ་རྫུ་འཕྲུལ་ཆེ་བ་མིའམ་ཅིའི་འཁོར་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་ལྡན་པ་ཆོས་མཉན་པའི་ཕྱིར་འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་འདུས་པར་གྱུར་ཏོ། །
en: These and other great kinnara kings, with retinues of many hundreds of thousands of kinnaras, came all together for the purpose of hearing the Dharma.

source: དེ་བཞིན་དུ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ཚངས་པ་ཆེན་པོ་དང་། འོད་གསལ་དང་། འོད་ཀྱི་སྒྲ་དང་། དག་པའི་འོད་དང་། བསོད་ནམས་འོད་དང་མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། འོག་མིན་དང་འོག་བཟང་དང་། །ཅི་ཡང་མེད་པ་དང་། ཅི་ཡང་མེད་མིན་དང་། ནམ་མཁའ་མཐའ་ཡས་དང་ལེགས་ལྡན་དང་ལེགས་ལྡན་མཐོང་དང་། སྤྲུལ་པ་བཟང་པོ་དང་ཡོངས་སུ་སྤྲུལ་པ་དང་གནས་གཙང་མ་དང་།
en: So did come: {1.90} The Sahāmpati Brahmās, the Great Brahmās , the gods from the heavens of Ābhāsvara, Prabhāsvara, Śuddhābha, Puṇyābha, Avṛha, Atapas, Akaniṣṭha, Sukaniṣṭha, Lokaniṣṭha, Ākiñcanya, Naivakiñcanya, Ākāśānantya, Naivākāśānantya, Sudṛśa, Sudarśana, Sunirmita, Paranirmita, Śuddhāvāsa, Tuṣita, and Yāma;

source: དགའ་ལྡན་དང་འཐབ་བྲལ་དང་སུམ་ཅུ་རྩ་གསུམ་དང་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་དང་།
en: the gods from the realm of the Thirty-Three and from the realm of the four great kings;

source: རྟག་ཏུ་མྱོས་དང་ཕྲེང་ཐོགས་དང་གཞོང་ཐོགས་དང་པི་བང་གསུམ་པ་དང་རི་བོར་གནས་པ་དང་ཁང་རྩེག་གནས་པ་དང་། རྩེ་མོར་གནས་པ་དང་ལྕང་ལོ་ཅན་ན་གནས་པ་དང་གྲོང་ཁྱེར་ན་གནས་པ་དང་གཞལ་མེད་ཁང་ན་གནས་པ་དང་བར་སྣང་ལ་གནས་པ་དང་། ས་ལ་གནས་པ་དང་ཤིང་ལ་གནས་པ་དང་ཁྱིམ་ན་གནས་པ་དང་།
en: the gods from the heavens of Sadāmatta, Mālādhāra, Karoṭapāṇi , and Vīṇātṛtīyaka ; the gods who dwell in mountains, on mountaintops, and on mountain peaks; those dwelling in Alaka, those who dwell in palaces and mansions, those who dwell in the sky, those who dwell on the earth, those who dwell in trees, and those who dwell in houses. {1.91}

source: དེ་བཞིན་དུ་ལྷ་མ་ཡིན་གྱི་དབང་པོ་རབ་ཏུ་ཚིམ་བྱེད་དང་། སྟོབས་ལྡན་དང་ཐགས་བཟངས་རིས་དང་ཤིན་ཏུ་བཀྲ་དང་བདེ་བཀྲ་དང་རིག་བྱེད་བཀྲ་དང་། སྒྲ་གཅན་དང་ལག་པ་དང་དེ་དག་ལ་སོགས་པ་ལྷ་མ་ཡིན་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དུ་མའི་འཁོར་དང་ལྡན་པ་འགྲོས་སྣ་ཚོགས་དང་། ནོར་སྣ་ཚོགས་དང་ལྷ་དང་འཐབ་པའི་ལྷ་མ་ཡིན་དེ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་འདུས་པར་གྱུར་ཏོ། །
en: Also came the kings of the dānavas, headed by Prahlāda, Balin, Rāhu, Vemacitri, Sucitri, Kṣemacitri, Devacitri, Rāhu, and Bāhu. {1.92} They had retinues of many hundreds of thousands of asuras—titans with extravagant habits, great and varied wealth, and a predilection to engage the gods in battle. Because of the bodhisattva’s blessing, they also joined this great assembly in order to witness, pay respect to, and attend this miraculous bodhisattvic event.

source: གང་ཡང་གཟའ་དང་གཟའ་ཆེན་པོ་དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྤྱོད་པ། བར་སྣང་ལ་སྤྱོད་པ་ལ་
en: In addition, there were also the grahas and the great grahas who work for the benefit of mankind and who dwell in the sky.

source: འདི་ལྟ་སྟེ། ཉི་མ་དང་ཟླ་བ་དང་མིག་དམར་དང་གཟའ་ལྷག་དང་ཕུར་བུ་དང་པ་བ་སངས་དང་སྤེན་པ་དང་སྒྲ་གཅན་དང་ས་འགུལ་དང་མཇུག་རིངས་དང་། གནམ་ལྕགས་འབྱིན་དང་སྐར་མ་དང་རྒྱལ་མཚན་དང་། མི་བཟད་དང་དུད་ལྡན་དང་དུད་པ་དང་རྡོ་རྗེ་དང་འབྱོར་པ་དང་། ཆར་འབེབས་དང་ཉེ་བའི་ཆར་འབེབས་དང་། ནོར་འཛིན་དང་མི་སྣང་བྱེད་དང་རྒོད་ལྡན་དང་རྟིང་བར་ལྡན་དང་འདོད་པ་དང་། མ་རུངས་པ་དང་འཇིག་རྟེན་མཐར་བྱེད་དང་རྣམ་པར་ལྟུང་བྱེད་དང་། ཀུན་དུ་ལྟུང་བྱེད་དང་། རྟོག་པ་དང་གླ་སྒང་ཅན་དང་དུས་ཀྱི་མཐའ་དང་དུར་ཁྲོད་དང་ཤ་དྲག་ལྡན་དང་དཀར་པོ་དང་། བྱི་བཞིན་དང་བྱི་བཞིན་གྱི་བུ་དང་བྱམས་ལྡན་དང་གཟེར་བུ་དང་། གཟེར་བུ་གསུམ་དང་རྔོན་པ་དང་གསེང་ཕྲོམ་དང་། བརྟན་པ་དང་འཇིག་བྱེད་དང་སྟོབས་ལྡན་དང་མི་བཟད་པ་དང་སྐྱ་རེངས་དང་རྣམ་པར་རྒོད་པ་དང་འཆི་ལྟས་མིན་དང་། སྐེམ་བྱེད་དང་ཀུན་བགེད་དང་། ཉེ་བའི་ཀུན་བགེད་དང་། གཞོན་ནུ་དང་། རྩེ་མེད་དང་། རྒོད་བྱེད་དང་། རབ་ཏུ་རྒོད་བྱེད་དང་། སེམས་པར་བྱེད་པ་དང་། གར་བྱེད་དང་། འཐེང་པོ་དང་། གཟུགས་ངན་ཏེ།
en: They were: {1.93} Āditya, Soma, Aṅgāraka, Budha, Bṛhaspati, Śukra , Śanaiścara, Rāhu, Kampa, Ketu , Aśani, Nirghāta, Tāra, Dhvaja, Ghora, Dhūmra, Dhūma, Vajra , Ṛkṣa, Vṛṣṭi, Upavṛṣṭi, Naṣṭārka, Nirnaṣṭa, Hasānta, Yāṣṭi, Ṛṣṭi, Duṣṭi, Lokānta, Kṣaya, Vinipāta, Āpāta, Tarka, Mastaka, Yugānta, Śmaśāna, Piśita, Raudra, Śveta, Abhija, Abhijata, Maitra , Śaṅku, Triśaṅku, Lubdha, Raudraka, Dhruva , Nāśana, Balavān, Ghora, Aruṇa, Vihasita, Mārṣṭi, Skanda, Sanat, Upasanat, Kumāra , Krīḍana, Hasana, Prahasana, Nartāpaka, Nartaka, Khaja, and Virūpa. {1.94}

source: གཟའ་ཆེན་པོ་དེ་དག་ཀྱང་རྒྱུ་སྐར་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་ལྡན་པ་ལ་
en: These great grahas too, along with retinues of many of hundreds of thousands of grahas, were in this great assembly.

source: ཐ་སྐར་དང་། བྲ་ཉེ་དང་། སྨིན་དྲུག་དང་། སྣར་མ་དང་། མགོ་དང་། ལག་དང་། ན་བ་སོ་དང་། རྒྱལ་དང་། སྐག་དང་། མཆུ་དང་། གྲེ་དང་། དབོ་དང་། མེ་བཞི་དང་། ནག་པ་དང་། ས་རི་དང་། ས་ག་དང་། ལྷ་མཚམས་དང་། སྣྲོན་དང་། སྣྲུབས་དང་། ཆུ་སྟོད་དང་། ཆུ་སྨད་དང་། གྲོ་བཞིན་དང་། མོན་གྲུ་དང་། མོན་གྲེ་དང་། ཁྲུམས་སྟོད་དང་། ཁྲུམས་སྨད་དང་། ནམ་གྲུ་དང་། ལྷ་མོ་འདྲ་དང་། བྱི་བཞིན་དང་པུ་ན་རྣ་བ་དང་། འོད་དང་། ཨང་གི་ར་སི་དང་། རྒྱུ་སྐར་དང་ཉེ་བའི་གྲེ་དང་། གྲེ་ལྡན་དང་། འཇིག་རྟེན་རབ་མཆོག་དང་། རབ་མཆོག་ལྡན་དང་། དཔལ་ལྡན་དང་། འཇིག་རྟེན་མགོན་པོ་དང་། ཆང་ལྡན་དང་། རྒྱལ་བྱེད་དང་། ནོར་ལྡན་དང་ལྷ་དོན་ཏེ།
en: Aśvinī, Bharaṇī, Kṛttikā, Rohiṇī, Mṛgaśirā, Ārdrā, both Punarvasus, Puṣya, Āśleṣā, Maghā, both Phalgunī, Hastā, Citrā, Svāti, Viśākhā, Anurādhā, Jyeṣṭhā, Mūlā, both Āṣāḍhās, Śravaṇā, Dhaniṣṭhā, Śatabhiṣā, both Bhadrapadās, Revatī, Devatī, Abhijā, Punarnavā, Jyotī, Aṅgirasī, Nakṣatrikā, both Phalgu and Phalguvatī, Lokapravarā, Pravarāṇikā, Śreyasī, Lokamātā, Īrā, Ūhā, Vahā, Arthavatī, and Surārthā. {1.96}

source: དེ་ལྟར་རྒྱུ་སྐར་གྱི་རྒྱལ་པོ་དེ་དག་ཀྱང་དེའི་ཚེ་གནས་གཙང་མའི་གཞལ་མེད་ཁང་དུ་རྒྱུ་སྐར་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་ལྡན་པ། སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱིས་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་འདུས་ཏེ་འཁོད་པར་གྱུར་ཏོ། །
en: These nakṣatra queens, with retinues of many hundreds of thousands of nakṣatras, gathered together in this great assembly in the realm of the Pure Abode through the blessing of the Buddha and took their seats.

source: ཁྱིམ་སུམ་ཅུ་རྩ་དྲུག་ལ་འདི་ལྟ་སྟེ།
en: Present were also the following thirty-six signs of the zodiac: {1.97}

source: ལུག་དང་། གླང་དང་། སྦྱོར་བ་དང་། སྦལ་པ་དང་། སེང་གེ་དང་། བུ་མོ་དང་། སྲང་དང་། སྡིག་པ་དང་། གཞུ་དང་། ཆུ་སྲིན་དང་། བུམ་པ་དང་། ཉ་དང་། མིའུ་ཐུང་དང་། ཉེ་བའི་བུམ་པ་དང་། བྷྲིང་ག་ར་དང་། རལ་གྲི་དང་། གླང་པོ་ཆེ་དང་། མ་ཧེ་དང་། ལྷ་དང་། མི་དང་། དགེ་ལྟས་དང་། དྲི་ཟ་དང་། འཇིག་རྟེན་དང་། གཡུང་དྲུང་རྒྱལ་དང་། དྲག་པོའི་གཟི་བརྗིད་དང་། ཟླ་བའི་འོད་དང་། ས་དང་། མུན་པ་དང་། རྡུལ་དང་། ཉེ་བའི་རྡུལ་དང་། སྡུག་བསྔལ་དང་། བདེ་བ་དང་། བྱང་ཆུབ་དང་། སོ་སོ་གཅིག་དང་། ཉན་ཐོས་དང་། དམྱལ་བའི་རིག་པ་འཛིན་པ་དང་། གཟི་བརྗིད་ཆེན་པོ་དང་། གཟི་བརྗིད་ཆེན་པོ་ལྡན་དང་། དུད་འགྲོ་དང་། ཡི་དགས་དང་། ལྷ་མ་ཡིན་དང་། ཤ་ལྡན་དང་། ཤ་ཟ་དང་། །གནོད་སྦྱིན་སྲིན་པོ་དང་། འབྱུང་པོ་ཐམས་ཅད་པ་དང་། འབྱུང་བ་པ་དང་། ཕྱོགས་ཀྱི་གླང་པོ་དང་། སྟེང་འགྲོ་དང་། ཐད་ཀར་འགྲོ་དང་། ཁ་བྱེ་བ་དང་། བསམ་གཏན་འགྲོ་དང་། རྣལ་འབྱོར་འགྲོ་དང་། རབ་ཏུ་གནས་དང་། མཆོག་དང་། བར་མ་དང་ཐ་མ་སྟེ།
en: Meṣa, Vṛṣabha, Mithuna, Karkaṭaka, Siṃha , Kanyā, Tula, Vṛścika, Dhanus, Makara, Kumbha, Mīna, Vānara, Upakumbha, Bhṛṅgāra, Khaḍga, Kuñjara, Mahiṣa, Deva , Manuṣya, Śakuna, Gandharva , Loka, Sarvajita, Ugratejas, Jyotsna, Chāya, Pṛthivī, Tama, Raja, Uparaja, Duḥkha, Sukha, Mokṣa, Bodhi, Pratyeka, Śrāvaka , Naraka, Vidyādhara, Mahoja, Mahojaska , Tiryak, Preta, Asura, Piśita, Piśāca, Yakṣa, Rākṣasa , Sarvabhūtika, Bhūtika, Nimnaga, Ūrdhvaga, Tiryaga, Vikasita, Dhyānaga, Yogapratiṣṭha, Uttama, Madhyama, and Adhama. {1.98}

source: ཁྱིམ་ཆེན་པོ་དེ་དག་ཀྱང་ཁྱིམ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་ལྡན་པ་གང་ན་གནས་གཙང་མའི་གཞལ་མེད་ཁང་གང་ན་བར་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་ལྷགས་ཤིང་ཕྱིན་ཏེ
en: These great rāśis, with retinues of many hundreds of thousands of rāśis, came to this great gathering in the realm of the Pure Abode.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་བཏུད་ནས་རང་རང་གི་གནས་སུ་འཁོད་པར་གྱུར་ཏོ། །
en: Having arrived, they bowed to the Lord’s feet and sat down in their respective seats.

source: གང་ཡང་གནོད་སྦྱིན་མོ་དག་གནོད་སྦྱིན་མོ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་བཅས་པ་ལ་འདི་ལྟ་སྟེ།
en: Also, the great yakṣiṇīs, with retinues of many hundreds of thousands of yakṣiṇīs, were present there. They were: {1.99}

source: མིག་བཟང་མ་དང་། སྨིན་བཟང་མ་དང་། སྐྲ་བཟང་མ་དང་། སྐད་སྙན་མ་དང་། བློ་བཟང་མ་དང་། དགེ་ལྡན་མ་དང་། སྣ་ཚོགས་མིག་ལྡན་མ་དང་། རྫོགས་བྱེད་མ་དང་། གསང་བ་མ་དང་། བཟང་པོ་མ་དང་། སྐ་རགས་བཟང་པོ་མ་དང་། པདྨ་ལྟར་སྨྲ་བ་དང་། འཇིགས་བྱེད་མ་དང་། མི་འཇིགས་སྦྱིན་མ་དང་། རྒྱལ་མ་དང་། རྣམ་པར་རྒྱལ་མ་དང་། ནམ་གྲུ་མ་དང་། སྒྲ་གཅན་མ་དང་། སྒྲ་མཐར་བྱེད་མ་དང་། རླུང་མ་དང་། ཡིད་འཕྲོག་མ་དང་། ཡིད་ལྡན་མ་དང་། མེ་ཏོག་ལྡན་མ་དང་། མེ་ཏོག་གི་གྲོང་ཁྱེར་ལ་གནས་མ་དང་། སེར་སྐྱ་མ་དང་། འཕྲོག་མ་དང་། དཔལ་ལྡན་མ་དང་། དཔའ་མོ་དང་། དཔའ་བཟང་མོ་དང་། ཤིན་ཏུ་མི་བཟད་མ་དང་། མི་བཟད་ལྡན་མ་དང་། ལྷ་མཛེས་མ་དང་། རོ་བཟང་མ་དང་། གསང་བ་དམ་པ་མ་དང་། ཤིང་ལ་མུ་ལ་གནས་མ་དང་། མྱ་ངན་མེད་མ་དང་། མུན་པར་མཛེས་མ་དང་། སྣང་བར་མཛེས་མ་དང་། འོད་ལྡན་མ་དང་། ལྷག་པར་ལྡན་མ་དང་། གཟུགས་མཛེས་མ་དང་། དཀར་མེད་མ་དང་། ཞི་བ་མ་དང་། ཕྱོགས་མཚམས་མ་དང་། སྟུག་མ་དང་། དགའ་བྱེད་མ་དང་། ཉེ་བའི་དགའ་བྱེད་མ་དང་། འཇིག་རྟེན་ལས་འདས་མ་སྟེ།
en: Sulocanā , Subhrū, Sukeśā, Susvarā, Sumatī, Vasumatī, Citrākṣī, Pūrāṃśā, Guhyakā, Suguhyakā, Mekhalā, Sumekhalā, Padmoccā, Abhayā, Abhayadā, Jayā, Vijayā, Revatikā, Keśinī , Keśāntā, Anilā, Manoharā, Manovatī, Kusumā, Kusumāvatī , Kusuma­pura­vāsinī, Piṅgalā, Hārītī, Vīramatī, Vīrā , Suvīrā, Sughorā, Ghoravatī, Surasundarī, Surasā, Guhyottarī, Vaṭavāsinī, Aśokā, Andhārasundarī, Ālokasundarī, Prabhāvatī, Atiśayavatī, Rūpavatī, Surūpā, Asitā, Saumyā, Kāṇā, Menā, Nandinī, Upanandinī, and Lokottarā. {1.100}

source: གནོད་སྦྱིན་མོ་ཆེན་མོ་འདི་དག་གནོད་སྦྱིན་མོ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་ལྡན་པ་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་རྒྱང་རིང་པོ་ཉིད་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་ཕྱག་འཚལ་ཞིང་འཁོད་པར་གྱུར་ཏོ། །
en: These great yakṣiṇīs, with retinues of many hundreds of thousands of yakṣiṇīs, bowing to Lord Śākyamuni from a distance, were present in this great gathering.

source: གང་ཡང་ཤ་ཟ་མོ་དག་ཤ་ཟ་མོ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་ལྡན་པ། འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་རྒྱང་རིང་པོ་ཉིད་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་ཕྱག་འཚལ་ཞིང་འཁོད་པར་གྱུར་པ་ལ་འདི་ལྟ་སྟེ།
en: Also the great piśācīs, with retinues of many hundreds of thousands of piśācīs, joined in, paying respects to Lord Śākyamuni. They were: {1.101}

source: སྡུད་མ་དང་ཕྱག་དར་ཁྲོད་ཀྱི་ཤ་ཟ་མོ་དང་། ཤ་ཟ་མོ་དྲག་མོ་དང་ཤ་ཟ་མོ་སྐར་མདའ་མ་དང་ཤ་ཟ་མོ་འབར་མ་དང་ཐལ་བ་ཟ་མ་དང་ཤ་ཟ་མ་དང་། དུག་མ་དང་བུང་བ་མ་དང་རྨོངས་བྱེད་མ་དང་སྡིགས་མཛུབ་མ་དང་། དམར་ལྡན་མ་དང་གླང་དམར་མ་དང་འཇིག་རྟེན་ཉེ་གནས་མ་དང་ཐལ་བར་ཉེ་གནས་མ་དང་ཤིང་པི་ལུ་དང་ལྡན་མ་དང་། མང་ལྡན་མ་དང་མང་མ་དང་གདུལ་དཀའ་མ་དང་། ཨེ་ལ་མ་དང་མཚོན་བྱེད་མ་དང་དུ་བ་ལ་གནས་མ་དང་དུ་བ་མ་སྟེ།
en: Maṇḍitikā, Pāṃsupiśācī, Raudrapiśācī, Ulkāpiśācī, Jvālāpiśācī, Bhasmodgirā, Piśitāśinī, Durdharā, Bhrāmarī, Mohanī, Tarjanī, Rohiṇikā, Govāhiṇikā, Lokāntikā, Bhasmāntikā, Pīluvatī, Bahulavatī, Bahulā, Durdāntā, Elā, Cihnitikā, Dhūmāntikā, Dhūmā, and Sudhūmā. {1.102}

source: ཤ་ཟ་མོ་ཆེན་མོ་འདི་དག་ཤ་ཟ་མོའི་འཁོར་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་བཅས་པ་དེ་དག་ཀྱང་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་འདུས་ཤིང་རབ་ཏུ་ཞུགས་པར་གྱུར་ཏོ། །
en: These great piśācīs, with retinues of many hundreds of thousands of piśācīs, also entered this great gathering.

source: གང་ཡང་མ་མོ་དང་མ་མོ་ཆེན་མོ་དག་འཇིག་རྟེན་གྱི་རྗེས་སུ་རྣམ་པར་སྤྱོད་ཅིང་། སེམས་ཅན་རྣམས་ལ་འཚེ་བར་བྱེད་ཅིང་། གཏོར་མ་དང་། མེ་ཏོག་དམན་མ་ལ་སྤྱོད་པར་བྱེད་པ་དག་ལ་འདི་ལྟ་སྟེ།
en: Also, the mātṛs and the great mātṛs, who wander throughout the world harming living beings and seizing oblatory offerings of food and garlands, joined in. They were: {1.103}

source: ཚངས་པ་མ་དང་། དབང་ཕྱུག་ཆེན་མོ་མ་དང་། ཁྱབ་འཇུག་མ་དང་། གཞོན་ནུ་མ་དང་། རྒན་བྱད་མ་དང་། ཕག་མོ་དང་། དབང་མོ་དང་། གཤིན་རྗེ་མོ་དང་། མེ་ཕྱོགས་མ་དང་། ཉི་མའི་བུ་མོ་དང་། འཇིག་རྟེན་མཐར་བྱེད་མ་དང་། ཆུ་ལྷ་མ་དང་། དབང་ལྡན་མ་དང་། རླུང་ཕྱོགས་མ་དང་། གཞན་གྱི་སྲོག་འཕྲོག་མ་དང་། མགོ་བྲེགས་མ་དང་། བྱ་མ་དང་། བྱ་མ་ཆེན་མོ་དང་། སྲུལ་མོ་དང་། ལུས་སྲུལ་མོ་དང་། སྐེམ་བྱེད་མ་སྟེ།
en: Brahmāṇī, Māheśvarī, Vaiṣṇavī, Kaumārī, Cāmuṇḍā, Vārāhī, Aindrī, Yāmyā, Āgneyā, Vaivasvatī, Lokāntakarī, Vāruṇī, Aiśānī, Vāyavyā, Paraprāṇaharā, Mukhamaṇḍitikā, Śakunī, Mahāśakunī, Pūtanā , Kaṭapūtanā, and Skandā. {1.104}

source: མ་མོ་ཆེན་མོ་དེ་དག་ཀྱང་མ་མོའི་འཁོར་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དུ་མ་དང་བཅས་པ་དེ་དག་ཀྱང་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་བྱ་བའི་ཚིག་འདོན་ཅིང་འཁོད་པར་གྱུར་ཏོ། །
en: These great mātṛs, with retinues of many hundreds of thousands of mātṛs, were present in this great assembly, calling out, “Homage to the Buddha!” {1.105}

source: དེ་བཞིན་དུ་མི་དང་མི་མ་ཡིན་པ་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དུ་མ་དང་། སེམས་ཅན་དང་སེམས་ཅན་མ་ཡིན་པ་ནས་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པ་ནས་སྲིད་པའི་རྩེ་མོའི་བར་དུ་ཐམས་ཅད་ཀྱང་སྐབས་འདིར་ནམ་མཁའི་དཀྱིལ་དུ་སྣང་བར་གྱུར་ཏོ། །
en: Similarly, the entire expanse of space with its many hundreds of thousands of beings, both human and nonhuman, sentient and non-sentient, from the great hell of Avīci to the pinnacle of saṃsāra, became open and accessible to sight.

source: སེམས་ཅན་གྱི་རིས་ན་སྲོག་ཆགས་སུ་ལ་ཡང་ཕན་ཚུན་མི་མཐུན་པ་མེད་པར་གྱུར་ཏོ། །
en: Within the totality of beings there was not a single one who would be in disharmony with another.

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཆོ་འཕྲུལ་གྱི་རྒྱན་གྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱི་བོའི་གཙུག་ན་བཞུགས་པར་མཐོང་བར་གྱུར་ཏོ། །
en: By the blessing of the Buddha enriched with the magical power of the bodhisattvas, all these beings then saw Lord Buddha and the divine youth Mañjuśrī seated on the crowns of their heads. {1.106}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་ཐམས་ཅད་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་རྣམ་པར་གཟིགས་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Now, Lord Śākyamuni, having looked over this entire assembly with his buddha eye, said to Mañjuśrī, the divine youth, “Please speak, O pure being!

source: དག་པའི་སེམས་དཔའ་སྔགས་ཀྱི་སྤྱོད་པའི་དོན་རྣམ་པར་གཏན་ལ་དབབ་པ་དང་ཏིང་ངེ་འཛིན་གྱི་ལེའུ་རབ་འབྱམ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་གང་འདི་བཤད་པའི་དུས་ལ་བབ་པར་སེམས་ན་ཤོད་ཅིག །
en: Give a full presentation of the section on samādhi that explains the meaning of mantra practice. Present this basket of bodhisattva teachings if you think that the moment is right.” {1.107}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་རྗེས་སུ་གནང་བར་མཛད་པ་ན། ནམ་མཁའི་ངོ་བོ་དང་འདྲ་བའི་རྡོ་རྗེ་མཐུག་ཅིང་སྲ་བའི་རྒྱུད་བཀོད་པའི་རྒྱན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: Then Mañjuśrī, the divine youth, with the approval of Lord Śākyamuni, entered the samādhi called the ornament of a contiguous formation solid as fused vajras, adorned with miraculous displays of the space-like nature .

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དེ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་གནས་གཙང་མའི་གཞལ་མེད་ཁང་དེ་དཔག་ཚད་བརྒྱ་སྟོང་དུ་མ་རྒྱ་ཆེ་བའི་རྡོ་རྗེའི་རང་བཞིན་དུ་ལྷག་པར་གནས་པར་གྱུར་ཏོ། །
en: As soon as Mañjuśrī, the divine youth, entered this samādhi, he blessed the realm of the Pure Abode, which extended over many hundreds of thousands of leagues, so that it became made of vajra s.

source: གང་དུ་གནོད་སྦྱིན་དང་སྲིན་པོ་དང་དྲི་ཟ་དང་རླུང་ལྷ་དང་ཤ་ཟ་དེ་དག་དང་། མདོར་ན་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་ཀྱིས་གཞལ་མེད་ཁང་དེ་དག་རྡོ་རྗེའི་ནོར་བུ་རིན་པོ་ཆེ་ལྟ་བུར་གྱུར་ཏེ
en: All the many yakṣa s, rākṣasas, gandharvas, mārutas, and piśācas—in short, the entire universe inhabited by living beings—became situated by the blessing of the bodhisattvas in this great palace that resembled diamond jewels and gems,

source: དེར་རབ་ཏུ་ཞུགས་ནས་འཁོད་པར་གྱུར་ཀྱང་ཕན་ཚུན་རྣམ་པར་འཚེ་བར་བྱེད་པ་མེད་དོ། །
en: and there took their seats together, without any mutual enmity. {1.108}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེ་འདུས་པར་གྱུར་པར་ཤེས་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་གཤིན་རྗེའི་གཤེད་ལ་སྨྲས་པ།
en: Mañjuśrī, the divine youth, seeing that this great assembly had gathered, said to Yamāntaka, the Lord of Wrath ,

source: ཀྱེ་ཁྲོ་བོ་ཆེན་པོ་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ངེས་པར་འབྱུང་བར་བྱེད་པ།
en: “Ho, ho, Great Lord of Wrath, who emanates from all the buddhas and bodhisattvas!

source: འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་འདུས་པ་འདིའི་སེམས་ཅན་ཐམས་ཅད་ལ་སྲུངས་ཤིག་སྲུངས་ཤིག །དབང་དུ་གྱིས་ཤིག་
en: Please protect this great gathering! Protect and enthrall it!

source: མ་རུངས་པ་གདུལ་བར་གྱིས་ཤིག་སེམས་ཅན་ཞི་བ་དག་སད་པར་གྱིས་ཤིག །
en: Tame the wicked ones! Awaken the gentle ones into realization!

source: སེམས་ཅན་ཐམས་ཅད་དད་པར་གྱིས་ཤིག །
en: Placate the implacable ones!

source: ཅི་སྲིད་དུ་ངའི་རང་གི་སྔགས་ཀྱི་སྤྱོད་པ་རྗེས་སུ་སྒྲུབ་པ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་རྒྱ་ཆེ་བ་དག་ལས་སྔགས་སྤྱོད་པའི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་འཆད་པར་བྱེད་པ་དེ་སྲིད་ཀྱི་བར་དུ་འདི་དག་གི་ཕྱི་རོལ་དུ་སོང་ལ་སྲུང་བ་གྱིས་ཤིག །
en: As long as I am teaching this bodhisattva basket that accords with my own mantra practice and contains the extensive instructions on mantra practice and the maṇḍala, please go outside and guard this gathering.” {1.109}
